# InsulationTypeSet Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsulationTypeSet Constructor
InsulationTypeSet Class See Also
---
Initializes a new instance of the InsulationTypeSet class
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public InsulationTypeSet()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
InsulationTypeSet()
```

# See Also
InsulationTypeSet Class
Autodesk.Revit.DB.Electrical Namespace